<?php

$string['pluginname'] = 'Тест на реализацию приложения';
$string['pluginnameadding'] = 'Добавление теста на реализацию приложения';
$string['pluginnameediting'] = 'Редактирование теста на реализацию приложения';
$string['pluginnamesummary'] = 'Данный вопрос позволяет попросить ученика написать программу, которая при отправке решения будет автоматически проверена и оценена';
$string['android_template_zip_file'] = 'ZIP файл с шаблоном';
$string['check_options'] = 'Параметры проверки';
$string['checker_system_name'] = 'Сервис проверки';
$string['hideresult_whileactive'] = 'Скрывать результаты теста, пока попытка в прогрессе';
$string['hideresult_afterfinish'] = 'Скрывать результаты теста после завершения попытки';
$string['maxbytes'] = 'Максимальный размер файла решения студента';
$string['results_are_hidden'] = '[Результаты скрыты] ';
$string['no_files_submitted'] = 'Решение было отправлено на проверку без файла. Если это не так, попробуйте ещё раз или свяжитесь с администрацией.';
$string['same_response_submitted'] = 'Отправленное решение идентично предыдущему. Проверьте архив и попробуйте ещё раз.';
$string['app_is_tested'] = '<b>Приложение протестировано</b>';
$string['submission_is_in_queue'] = 'Ваше решение находится в очереди. Следите за статусом тестирования, обновляя страницу.';
$string['task:update_quiz_grades'] = 'Обновить оценки за попытки тестов с вопросами AppsTester';
