<?php

$string['pluginname'] = 'Тест на реализацию приложения';
$string['pluginnameadding'] = 'Добавление теста на реализацию приложения';
$string['pluginnameediting'] = 'Редактирование теста на реализацию приложения';
$string['pluginnamesummary'] = 'Данный вопрос позволяет попросить ученика написать программу, которая при отправке решения будет автоматически проверена и оценена';
$string['android_template_zip_file'] = 'ZIP файл с шаблоном';
$string['no_files_submitted'] = 'Похоже, Вы отправили на проверку решение без файла. Если это не так, попробуйте ещё раз или свяжитесь с администрацией.';
$string['same_response_submitted'] = 'Похоже, отправленное Вами решение идентично предыдущему, проверьте отправленный архив и попробуйте ещё раз.';
